 [
    {
      "contents": "<p>Due to the rapid growth of World First, the HR Department are looking for an experienced, enthusiastic and pro-active Learning &amp; Development Manager to join their team. Reporting into the Global Head of Learning &amp; Development, your key focus will be to support our London office.</p>\n\n<p><strong>Key responsibilities</strong></p>\n\n<ul><li>Build and maintain relationships with department heads, identifying development needs and trends. Work with the L&amp;D Advisor to identify and source development solutions, in line with global L&amp;D initiatives.</li><li>Partner with Gallus Consulting to deliver our management programme locally (Managing People First), including 360 debriefs, workshop and ALG facilitation and one-to-one coaching.</li><li>Develop and manage a core offering to continue the development of our Managing People First Alumni, in line with current and future business requirements</li><li>Work with the L&amp;D Advisor to design and deliver soft skills training, partnering with external providers when required. Support the L&amp;D Advisor in creating a core offering for continued development in line with business needs.</li><li>Support managers with performance reviews and personal development planning, providing ongoing training, guidance and one-to-one coaching</li><li>Embed our behavioural competency framework into core HR/L&amp;D processes</li><li>Oversee professional qualifications, working with Compliance and CF30 managers to ensure T&amp;C requirements are met</li><li>Work with the L&amp;D Advisor to evaluate all local L&amp;D programmes and interventions, demonstrating ROI and continual improvement</li><li>Work with the Global Head of L&amp;D to set the annual L&amp;D strategy and budget for EMEA, and manage this accordingly</li><li>Produce bi-annual L&amp;D reports demonstrating key activities and ROI</li><li>Line manage the L&amp;D Advisor and oversee our core programmes (ie induction, internal seminars, etc)</li><li>Provide L&amp;D support to our Netherlands office, as well as any future offices in the EMEA region as we continue to grow</li></ul>\n\n<p> <strong>You will</strong><strong>:</strong></p>\n\n<ul><li>Be educated to degree level and/or HR/L&amp;D professionally qualified, with a proven track record in a similar role</li><li>Have a track record of delivering forward thinking L&amp;D initiatives and be experienced in business partnering to a senior level</li><li>Have experience in designing and delivering high quality training, with strong presentation and facilitation skills</li><li>Have knowledge and experience in leadership/management development</li><li>Have prior experience in a financial services company (preferable but not essential)</li><li>Be a strong communicator with the ability to establish and manage relationships at all levels</li><li>Be solutions focused with strong analytical skills and a consultative approach</li><li>Be a strong team player but have the ability to work autonomously</li><li>Be a brilliant people person who thrives on the development of people and takes pride in delivery of L&amp;D solutions</li></ul>\n\n<p><strong>What you will get:</strong></p>\n\n<ul><li>Basic salary: Competitive</li><li>Excellent benefits package including annual discretionary bonus, season ticket loan, company pension scheme and health cover</li><li>A fun working environment based in central London</li><li>Free breakfast, Friday beer fridge, tri-annual company parties, bi-annual team nights out, annual charity day and more!</li></ul>\n\n<p><br>#LI-BR1</p>",
      "name": "Learning & Development Manager",
      "type": "external",
      "publication_date": "2017-02-11T14:09:25.163471Z",
      "short_name": "learning-development-manager-89fbae",
      "model_type": "jobs",
      "id": 126085,
      "locations": [
        {
          "name": "London, United Kingdom"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/worldfirst/learning-development-manager-89fbae"
      },
      "company": {
        "id": 1170,
        "short_name": "worldfirst",
        "name": "World First"
      }
    },
    {
      "contents": "<p>(New York, NY)</p>\n\n<p>Facebook’s mission is to give people the power to share, and make the world more open and connected. Through our growing family of apps and services, we’re building a different kind of company that helps billions of people around the world connect and share what matters most to them. Whether we’re creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to make the world more open and accessible. Connecting the world takes every one of us—and we’re just getting started.</p>\n\n<p>Analogous to an Account Director in an agency, the Head of Americas serves as the overall general manager for the Guild and supports the business and marketing needs of the region. He/she oversees all creative and digital projects and initiatives and ensures that they are insight-driven, on-brand, and on-strategy and that they are delivered in an efficient, cost-effective manner that drives scaled results for the business.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n    <li>Oversees all Guild projects and activities, spanning across creative and digital, serving as initial point of a contact for all creative and digital briefs across both North America and Latin America</li>\n    <li>Serves as connective tissue across digital and creative efforts</li>\n    <li>Partners closely with creative teams to ensure work is on brand and delivers on creative briefs and is activated across all appropriate channels</li>\n    <li>Partners closely with digital teams to ensure insights are leveraged for creative work and that results/learnings are shared/scaled across the region</li>\n    <li>Manages overall relationships and partnerships with vertical/audience/country managers</li>\n    <li>Partners closely with regional leadership and vertical/audience/country managers to understand needs and priorities and plan for work accordingly</li>\n    <li>Leads development, coordination, and activation of global campaigns in region</li>\n    <li>Oversees the activation of all global campaigns across countries/region, partnering closely with vertical managers/audience managers/country managers to ensure campaigns are localized properly and that they have the resources, assets, and tools they need to effectively scale global programs to their audiences</li>\n    <li>Leads development of pan-regional campaigns and oversees execution and activation with vertical/audience/country managers</li>\n    <li>Manages all cross-regional marketing vendors and relationships</li>\n    <li>Oversees roll-out and usage of marketing tools, such as Workfront, creative brief, etc.</li>\n    <li>Identifies programs and assets created in other regions than can be scaled within their region and communicate with vertical/audience/country managers to determine applicability</li>\n    <li>Oversees all regional Guild budgets and budgeting processes</li>\n    <li>Sits on global Guild leadership team and participates in the global management and evolution of the Guild (contribute needs and prospective solutions)</li>\n</ul>\n\n<p>Minimum Qualifications</p>\n\n<ul>\n    <li>15+ years of marketing experience</li>\n    <li>Ability to manage numerous projects and programs</li>\n    <li>Knowledge of digital marketing</li>\n    <li>Ability to work with creative teams</li>\n    <li>Ability to oversee operations</li>\n</ul>",
      "name": "Head of Americas, Guild",
      "type": "external",
      "publication_date": "2017-01-11T08:28:51Z",
      "short_name": "head-of-americas-guild-fea3b2",
      "model_type": "jobs",
      "id": 165178,
      "locations": [
        {
          "name": "New York City Metro Area"
        }
      ],
      "categories": [
        {
          "name": "Marketing"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [
        {
          "name": "Fortune 1000",
          "short_name": "fortune-1000-companies"
        }
      ],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/facebook/head-of-americas-guild-fea3b2"
      },
      "company": {
        "id": 659,
        "short_name": "facebook",
        "name": "Facebook"
      }
    },
    {
      "contents": "<p>Veterinary Assistant Careers at Banfield Pet Hospital</p>\n\n<p>For those who want to put their love of pets into action, there are few jobs more rewarding than that of Vet Assistant. While working closely with other pet health care professionals at Banfield, you’ll have the chance to advocate for pets and educate clients on all aspects of pet health. In addition, if your goal is to advance in your career, you’ll have access to a variety of learning and development opportunities along the way.</p>\n\n<p>Job Description Summary: The Veterinary Assistant is a key member of the hospital team who supports and assists the veterinarians and veterinary technicians, ensuring the safety of pets, clients and other associates, and the continuity of quality veterinary care.</p>\n\n<p>Employment Type: Full-Time</p>\n\n<p>Preferred Education/Licenses: Certificate of completion from a NAVTA-approved veterinary assistant program or the equivalent combination of education, training and experience that provides the required knowledge, skills and abilities. High school diploma or equivalent preferred.</p>\n\n<p>Preferred Experience: Must be able to perform all required skills of NAVTA-approved veterinary assistant programs at a level that aids in the efficiency of the practice.</p>\n\n<p>A Day in the Life of a Banfield Veterinary Assistant</p>\n\n<p>The Vet Assistant provides professional, efficient and exceptional service at all times, making sure that clients and pets are comfortable in the hospital. You will use your technical skills on a daily basis, within state practice acts and as outlined in the NAVTA guidelines for veterinary assistant skills and duties. Other responsibilities include:</p>\n\n<ul>\n    <li>Helping maintain the flow of patients</li>\n    <li>Communicating with the veterinarian and vet techs</li>\n    <li>Carrying out or setting up procedures that do not require veterinarian or vet tech assistance</li>\n    <li>Adhering to hospital standards that keep pets safe, and the treatment areas, exam rooms and labs clean and organized</li>\n    <li>Educating clients about our Optimum Wellness Plans® and the importance of preventive care</li>\n    <li>Mentoring other members of the hospital team</li>\n</ul>\n\n<p>Commitment Beyond Qualifications</p>\n\n<p>Every associate including the Vet Assistant has an important contribution to make to the veterinary team. We’re looking for Vet Assistants who are dedicated to their work, have a positive attitude and use our Five Principles — Quality, Responsibility, Mutuality, Efficiency and Freedom – as their guide. In addition, our Vet Assistants are:</p>\n\n<ul>\n    <li>Action Oriented</li>\n    <li>Customer Focused</li>\n    <li>Good Listeners</li>\n    <li>Effective Communicators</li>\n</ul>\n\n<p>Caring for Those Who Care: Benefits for a Banfield Veterinary Assistant</p>\n\n<p>When it comes to benefits, we support your personal wellness and professional development. We offer a wide range of perks and programs that help you take care of yourself and your family—including your pets.</p>\n\n<p>Personal Health, Savings, and Wellness Benefits</p>\n\n<p>Every team member needs to be appreciated. All Vet Assistants receive a generous benefits package including 401(k) participation, paid time off and Optimum Wellness Plans for your pets. In addition, medical, vision, dental, life and disability insurance is offered to associates based on eligibility.</p>\n\n<p>Potential as Big as Your Passion</p>\n\n<p>Whether you’re a new Vet Assistant, have been working for years or are changing careers, we’ll support your professional growth with:</p>\n\n<ul>\n    <li>Performance development plans designed to help you reach your established careers goals</li>\n    <li>Relevant learning opportunities</li>\n    <li>Networking events</li>\n    <li>Ways to offer your skills to your community</li>\n</ul>\n\n<p>A Support Structure That Helps You Thrive</p>\n\n<p>We’ve created a one-of-a-kind leadership structure throughout our practice that includes support from our Corporate headquarters, the field and hospital level. Together we are a team, making a real impact on pet health care in hospitals, communities and the field of veterinary medicine.</p>\n\n<p>Start your Banfield Career as a Veterinary Assistant</p>\n\n<p>Learn more about the impact you can make as part of a Banfield hospital team and see how we support the wellness of our people and profession.</p>\n\n<p>View the full job description or if you’re ready to make your move, apply today!</p>",
      "name": "Veterinary Assistant",
      "type": "external",
      "publication_date": "2017-02-07T09:25:50Z",
      "short_name": "veterinary-assistant-6688dc",
      "model_type": "jobs",
      "id": 192773,
      "locations": [
        {
          "name": "Irvine, CA"
        }
      ],
      "categories": [
        {
          "name": "Veterinary & Animal Health"
        }
      ],
      "levels": [
        {
          "name": "Entry Level",
          "short_name": "entry"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/banfieldpethospital/veterinary-assistant-6688dc"
      },
      "company": {
        "id": 707,
        "short_name": "banfieldpethospital",
        "name": "Banfield Pet Hospital"
      }
    },
    {
      "contents": "<p><strong>About Andela</strong></p>\n\n<p>Andela extends engineering teams with world-class software developers. We recruit the most talented developers on the African continent, shape them into technical leaders, and place them as full-time distributed team members with companies that range from Microsoft and IBM to dozens of high-growth startups. Backed by Chan Zuckerberg Initiative, GV (Google Ventures) and Spark Capital, Andela is building the next generation of global technology leaders.</p>\n\n<p><strong>About the Role: Entry-Level Sales</strong></p>\n\n<p>We need driven, ambitious, and passionate Business Development Representatives to find opportunities for Andela Fellows to work with the best software companies in the world. You will be responsible for outbound prospecting and lead generation, building a pipeline of new prospective clients and setting them up to connect with our Client Executive team. </p>\n\n<p><strong>High-level view of who you are:</strong></p>\n\n<ul>\n<li>Your strong drive to make the world more equitable energizes you to push forward, even when the challenge is great.</li>\n<li>You have an entrepreneurial instinct; you are analytical, a problem solver, and are always looking to maximize efficiencies. You love using data to support your hypotheses.</li>\n<li>You are good with people and can understand their needs. You pick up on social cues, learn from others, and are always looking for feedback and ways to improve.</li>\n</ul>\n\n<p><strong>In this job you will</strong>:</p>\n\n<ul>\n<li>Develop new business opportunities through outbound outreach. You'll find companies who will be a good fit for Andela and identify decision-makers to build up a pipeline of qualified leads for the Client Executives.</li>\n<li>Use your top-notch writing skills to craft messaging that can effectively engage tech executives at the nation's leading companies who are seeking engineering talent. </li>\n<li>Work closely with the Sales and Marketing teams to execute targeted prospecting campaigns and pilot new approaches to grow Andela's client base.</li>\n<li>Actively participate in weekly trainings to grow your sales abilities and be a strong ambassador for Andela.</li>\n</ul>\n\n<p><strong>Requirements (what makes you a great fit for this role):</strong></p>\n\n<ul>\n<li>1-3 years of work experience. Start-up and sales experience is a plus.</li>\n<li>Excellent communication skills. You've mastered the art of a well-written email.</li>\n<li>Sharp attention to detail. You are highly organized and process-driven.</li>\n<li>Proven initiative and persistence. You look for creative ways to overcome objections.</li>\n<li>Passion for Andela's mission and a personal desire to change the world.</li>\n<li>Be a good person! We have a “no jerk” policy at Andela and have a lot of fun.</li>\n</ul>",
      "name": "Business Development Representative",
      "type": "external",
      "publication_date": "2017-02-11T14:07:38.501863Z",
      "short_name": "business-development-representative-05be37",
      "model_type": "jobs",
      "id": 67258,
      "locations": [
        {
          "name": "New York City Metro Area"
        }
      ],
      "categories": [],
      "levels": [],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/andela/business-development-representative-05be37"
      },
      "company": {
        "id": 744,
        "short_name": "andela",
        "name": "Andela"
      }
    },
    {
      "contents": "<p>Strong background in the research and development tax credit and/or other federal credits and incentives? Lead tax incentive engagements requiring complex insight for a variety of industries? Passion for providing value to your clients? Exceptional project management and people development skills? If this is you, check the “apply” box!</p>\n\n<p>Work you’ll do:</p>\n\n<p>As a Tax Manager you will have responsibility for:</p>\n\n<ul>\n    <li>Managing federal credits and incentives opportunities including research and development tax credit/deduction analyses, Section 199 deduction engagements, and other federal credit incentive service offerings.</li>\n    <li>Leveraging your extensive technical skills developed through your growing reputation in a given industry / service offering to solve complex issues.</li>\n    <li>Demonstrating sound judgement and instincts with respect to evaluating complex scenarios involving various credits and incentives opportunities.</li>\n    <li>Developing, mentoring, and motivating Senior Consultants and Consultants, providing counseling and career guidance.</li>\n</ul>\n\n<p>The Team:</p>\n\n<p>National Federal Tax Services (NFTS) is a national practice within Deloitte Tax LLP made up of a number of tax service offerings. Each NFTS service offering has been developed and built as a result of a tax planning idea, a marketplace need, or a technological innovation – all with the purpose of delivering results for our clients. Our people are entrepreneurial in spirit and have always had the work-hard/play-hard mentality. NFTS service lines provide tax planning and compliance support for the largest organizations across all industries.</p>\n\n<p>The NFTS Research &amp; Development and Government Incentives (RDGI) tax team is a national team of specialists dedicated to providing comprehensive tax credit and incentive services, including the research and development credit, the domestic production activities deduction, and other federal credits such as the new market tax credit. These benefits are offered for activities conducted in the United States, as well as research performed in over 30 other countries that offer research incentives. The R&amp;D credit is one of the most significant of the remaining U.S. domestic tax credits.</p>\n\n<p>Qualifications</p>\n\n<p>Required:</p>\n\n<ul>\n    <li>5+ years’ experience in core federal tax compliance</li>\n    <li>Bachelor’s degree in accounting, finance, engineering, technology, or related field</li>\n    <li>Proven knowledge of R&amp;D tax incentives experience and/or experience with Section 199</li>\n    <li>CPA, Enrolled Agent, or other appropriate certification</li>\n    <li>Proven leadership skills demonstrating strong judgment, problem-solving, and decision-making abilities</li>\n    <li>Demonstrated effective research, and verbal and written communication skills</li>\n    <li>Proven experience effectively prioritizing workload to meet deadlines and work objectives</li>\n    <li>Ability to participate in all aspects of engagement strategic planning initiatives</li>\n    <li>Strong project management and organizational skills</li>\n    <li>Able to travel up to 30%</li>\n    <li>Preferred:</li>\n    <li>Advanced degree such as MST, MAcc, LLM, or JD</li>\n    <li>Big 4 experience or equivalent</li>\n</ul>\n\n<p>How you’ll grow</p>\n\n<p>At Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Center.</p>\n\n<p>Benefits</p>\n\n<p>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.</p>\n\n<p>Deloitte’s culture</p>\n\n<p>We take pride in our culture and celebrate individuals by recognizing their uniqueness. As a commitment to our people, we offer well-being programs and provide our professional’s opportunities for support and flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. This supportive culture helps enable our people to do their best work every day. Learn more about Life at Deloitte.</p>\n\n<p>Corporate citizenship</p>\n\n<p>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</p>\n\n<p>Recruiter tips</p>\n\n<p>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.</p>\n\n<p>#LI:TAX</p>\n\n<p>Requisition code: E17MGRTCHIFS005-NFT</p>",
      "name": "R&D Tax Manager, federal tax, compliance, accounting, federal credits, incentives, 199",
      "type": "external",
      "publication_date": "2016-12-27T21:49:20Z",
      "short_name": "rd-tax-manager-federal-tax-compliance-accounting-federal-credits-incentives-199-c3d860",
      "model_type": "jobs",
      "id": 204305,
      "locations": [
        {
          "name": "Atlanta, GA"
        }
      ],
      "categories": [
        {
          "name": "Accounting & Finance"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/rd-tax-manager-federal-tax-compliance-accounting-federal-credits-incentives-199-c3d860"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    },
    {
      "contents": "<p>Start your future with a new mission; Northrop Grumman Mission Systems.</p>\n\n<p>We’re a team of new graduates and experienced professionals, collaborating to achieve our goals. On the Mission Systems Sector team you’ll join our experts in developing systems and solutions that keep our world safe. Together, we protect our troops, public safety, information, and our planet. It’s unique work. It’s challenging and rewarding. But most of all, it’s work that makes a difference. Join us and launch your career. We’ll support you with training, employee resource groups, and our shared vision of global security.</p>\n\n<p>Northrop Grumman is seeking a Systems Administrator 1. This position will be located at our Mission Systems Sector in Redondo Beach, CA.</p>\n\n<p>The qualified candidate will become part of Northrop Grumman’s Engineering, Manufacturing and Sciences organization. The selected candidate will work in an Information Technologies Lab consisting of diverse vendor platforms, software and applications, supporting development, test and operational environments.</p>\n\n<p>Roles and Responsibilities</p>\n\n<ul>\n    <li>Work 3rd shift (10PM – 6AM) as system administrator responsible for Linux, Windows operating systems and layered product performance</li>\n    <li>Provide troubleshooting, maintenance, and technical support in a state-of-the-art computer environment. With additional access levels as a privileged user, will ensure System and Network security controls are maintained and grant access to authorized SW developers and engineers</li>\n    <li>Provide walk-in and phone support to users (help desk) resolving user account issues, system performance and data archiving/restore. Devise and maintain data integrity strategies and techniques to meet strict security requirements in a highly classified environment</li>\n    <li>Candidate will install and configure computer assets into a rack or sets of racks based on provided drawings or engineer their own. Unpack and inventory computer property and ensure facility environments and health and safety guidelines are met when configuring and deploying systems</li>\n    <li>Work independently with minimal management oversight</li>\n</ul>\n\n<p>Basic Qualifications</p>\n\n<p>A candidate, regardless of age and hiring source, must meet ALL of the below criteria. The candidate must:</p>\n\n<ul>\n    <li>Be completing or has completed their degree (Bachelor’s, Master’s, or PhD) from an accredited institution; It must be no more than 1 year if the degree has already been obtained</li>\n    <li>Not have professional work experience in their field of study (excluding internships, co-ops, or research studies)</li>\n    <li>Be majoring in Math, Computer Science or Engineering</li>\n    <li>Have an overall cumulative GPA of 3.25/4.0 or higher (unofficial academic transcripts must be provided at time of application by uploading the documents to your application or profile)</li>\n    <li>Be able to obtain a U.S. Government security clearance (U.S. citizenship is a pre-requisite)</li>\n</ul>\n\n<p>Preferred Qualifications</p>\n\n<ul>\n    <li>Have an overall cumulative GPA of 3.70/4.0 or higher</li>\n    <li>Self-motivated, willing to learn, and interested in working in a team environment.</li>\n    <li>Experience in working in an autonomous work environment on complex projects.</li>\n    <li>Experience in working on business or engineering full life-cycle projects from project inception through launch.</li>\n</ul>\n\n<p>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.</p>\n\n<p>Join our Talent Community:</p>\n\n<p>LIKE NorthropGrummanCareers on Facebook http://ar.gy/FacebookNGCareers</p>\n\n<p>FOLLOW Northrop Grumman Corporation on LinkedIn http://ar.gy/LinkedInNGCareers</p>\n\n<p>FOLLOW @NG_Careers on Twitter http://ar.gy/TwitterNGCareers</p>\n\n<p>SUBSCRIBE to our YouTube Channel: NorthropGrummanMedia http://ar.gy/YouTubeNGCareers</p>\n\n<p>Discover more about our careers at careers.northropgrumman.com</p>",
      "name": "2017 New Grad Systems Administrator 1 - EM&S (Redondo Beach)",
      "type": "external",
      "publication_date": "2017-02-06T20:57:45Z",
      "short_name": "2017-new-grad-systems-administrator-1-ems-redondo-beach-4e9150",
      "model_type": "jobs",
      "id": 213685,
      "locations": [
        {
          "name": "El Segundo, CA"
        }
      ],
      "categories": [
        {
          "name": "Computer Systems Support"
        }
      ],
      "levels": [
        {
          "name": "Entry Level",
          "short_name": "entry"
        }
      ],
      "tags": [
        {
          "name": "Fortune 1000",
          "short_name": "fortune-1000-companies"
        }
      ],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/northropgrumman/2017-new-grad-systems-administrator-1-ems-redondo-beach-4e9150"
      },
      "company": {
        "id": 792,
        "short_name": "northropgrumman",
        "name": "Northrop Grumman"
      }
    },
    {
      "contents": "<p>Just like the old carpentry adage: “Measure twice and cut once”, with IT transformation projects you need to plan thoroughly before executing. Developing a clear technology roadmap and corresponding business cases can be time consuming and require resources with both detailed technical knowledge as well as advanced business acumen. Finding the necessary skills set to complete this activity, with the both the skill set and experience developing large scale transformation strategies can be difficult. Our team of consultants can help merge this gap and deliver the promised value in the defined budget.</p>\n\n<p>Work you’ll do</p>\n\n<ul>\n    <li>Understanding the transformation areas, business themes, and opportunities available for exploitation.</li>\n    <li>Executing the digital vision prescribed by client leadership.</li>\n    <li>Realizing a return or an increase in customer satisfaction based on digital investments.</li>\n    <li>Implementing systems that provide the ability for various groups to communicate efficiency and effectively.</li>\n    <li>Increasing the communication of products and service offerings to the right audience.</li>\n</ul>\n\n<p>The team</p>\n\n<p>Our IT consultants are package agnostic with deep industry depth. We help clients build realistic and scalable digital strategies that meet their company specific needs while accounting for industry trends and potential disruptive forces in their industry segment. Learn more about Deloitte Digital.</p>\n\n<p>Qualifications</p>\n\n<p>Required:</p>\n\n<ul>\n    <li>Four+ years’ experience in consulting and/or implementing solutions leveraging a combination of customer technology strategy, future state architecture design and CRM project delivery.</li>\n    <li>Experience delivering projects focusing on two or more of the following areas:</li>\n    <li>Customer Value &amp; Strategy – Development of customer driven, value enhancing strategies to drive increased business effectiveness, improved technology utilization, and enhanced positioning to address marketplace forces</li>\n    <li>Customer Transformation Roadmapping – Build out of enterprise customer solution strategy, technology architecture, platform alternatives, and roadmaps to support and enable business and technology vision and goals. Construction of detailed customer transformation plan to clearly articulate initiatives required to effectively and consciously transform an enterprise to the target future state</li>\n    <li>Business Case Operational Analysis – Execution of comprehensive financial analysis detailing the costs, benefits, and estimated payback period/return of current and planned business and technology customer solutions initiatives, program, and projects.</li>\n    <li>Platform Evaluation &amp; Selection – Execution of proven methodologies to objectively identify, evaluate, and select technology platforms and tools that most effectively enable planned customer transformation. Evaluation and analysis of the effectiveness of existing solutions, platforms, and tools against selected business and technology KPIs and strategic goals</li>\n    <li>Process &amp; Technology Improvement – Performing of detailed assessments on the effectiveness of ‘customer impacting’ processes and recommendations to align to corporate goals, market trends. Development, alignment, and deployment of future state operating model and processes to match organizational strategic goals and vision.</li>\n    <li>Experience leading functional or technical teams at client sites on at least two complex full-lifecycle technology project implementations.</li>\n    <li>Experience designing and implementing technology-enabled business solutions in client-facing and team leadership roles (e.g. technical lead, functional lead, workstream lead, project manager).</li>\n    <li>Ability to travel to client sites 80-100% of the time</li>\n    <li>A Bachelor’s degree.</li>\n</ul>\n\n<p>How you’ll grow</p>\n\n<p>At Deloitte Digital, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help sharpen skills, work with industry-leading talent on a daily basis, in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career, while delivering products and services to Fortune 500 clients. Explore Deloitte University, The Leadership Center.</p>\n\n<p>Benefits</p>\n\n<p>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.</p>\n\n<p>Deloitte’s culture</p>\n\n<p>Who says work can’t be fun? At Deloitte Digital, the worlds of business, creative, and technology intersect to transform the way we work, play, and communicate. We can’t quite put our finger on it, but that combo creates something kind of magical. In studios or on the road, we believe in our people, and we understand that quality of life directly impacts quality of work. We pride ourselves on our flexible work environment and distinctive culture. Learn more about life at Deloitte Digital.</p>\n\n<p>Corporate citizenship</p>\n\n<p>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</p>\n\n<p>Recruiter tips</p>\n\n<p>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.</p>\n\n<p>kwdeldigvdsusa</p>\n\n<p>kwdeldigmrwusa</p>\n\n<p>kwdeldigecpusa</p>\n\n<p>kwdeldigallddusa</p>\n\n<p>Requisition code: E17NATCSRCKG008 – DD</p>",
      "name": "Digital Business and Strategy Senior Consultant",
      "type": "external",
      "publication_date": "2016-12-27T21:48:04Z",
      "short_name": "digital-business-and-strategy-senior-consultant-cb771e",
      "model_type": "jobs",
      "id": 204819,
      "locations": [
        {
          "name": "Dallas, TX"
        }
      ],
      "categories": [
        {
          "name": "Consultants & Freelance Opportunities"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/digital-business-and-strategy-senior-consultant-cb771e"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    },
    {
      "contents": "<p><strong>Job Description</strong><br/>\nInterested in Amazon Echo? Come work on it. We’re building the speech and language solutions behind Amazon Echo and other Amazon products and services. We’re working hard, having fun, and making history; come join us!<br> <br> Amazon is looking for a Language Engineer to join our data engineering team in the area of speech and language data processing. We are seeking a candidate with strong experience in linguistic annotation, ontologies, taxonomies, semantic schemas. In this role, you will support new feature development by extending existing annotation schemas to cover new concepts. <br> <br> Specifically, the Language Engineer will:<br>- Contribute to the design of new features by extending existing annotation schemas to cover new areas<br>- Collaborate with scientists and other Language Engineers in developing coherent and comprehensive meaning representation frameworks<br>- Lead annotation efforts to test and solidify new representations<br> - Provide day-to-day coordination of data collection efforts, including planning, scheduling, and reporting<br>- Measure and analyze accuracy and throughput of annotated data<br>- Handle competing requests from a range of data customers<br><br><br><br></p>\n<p><strong>Basic Qualifications</strong><br/>\n- Bachelor’s degree in a relevant field<br> - 2+ years experience in computational linguistics, language data processing, semantics, philosophy of language<br>- Experience with language annotation and other forms of data markup<br>- Experience with ontologies and other semantic meaning representation schemas<br>- Comfortable working with speech and text language data in multiple languages<br> - Experience in Perl, Python, or another scripting language<br> - Familiarity with database queries and data analysis processes (SQL, R, Matlab, etc.)<br> - Excellent communication, strong organizational skills and very detailed oriented<br> - Comfortable working in a fast paced, highly collaborative, dynamic work environment<br> - Willingness to support several projects at one time, and to accept reprioritization as necessary<br> - Must be able to think creatively and possess strong analytical and problem solving skills<br></p>\n<p><strong>Preferred Qualifications</strong><br/>\n- Deep expertise in building ontologies, taxonomies, and semantic meaning representation frameworks<br>- Experience in writing grammars and building FSTs<br>- Experience with statistical language modeling<br> - Practical knowledge of version control and agile development<br> - Strong attention to detail<br> - Exceptional level of organization<br> - Fluency in a foreign language a plus<br></p>",
      "name": "Language Engineer",
      "type": "external",
      "publication_date": "2017-02-11T14:04:59.183966Z",
      "short_name": "language-engineer-7fa0d7",
      "model_type": "jobs",
      "id": 180649,
      "locations": [
        {
          "name": "Boston Metro Area"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Entry Level",
          "short_name": "entry"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/amazonlab126/language-engineer-7fa0d7"
      },
      "company": {
        "id": 1164,
        "short_name": "amazonlab126",
        "name": "Amazon Lab126"
      }
    },
    {
      "contents": "<p>We’re a team ofnew graduates and experienced professionals, collaborating to achieve ourgoals. Our teams work with pride across business units toward a common goal:global security. Together, we protect our troops, public safety, information,and our planet. It’s unique work. It’s challenging and rewarding. But most ofall, it’s work that makes a difference. Join us and launch your career. We’llsupport you with training, employee resource groups, and our shared vision ofglobal security.</p>\n\n<p>Support advancedconcept and preliminary design of aircraft by performing configurationanalysis, design, test and integration of advanced aerospace vehicles as partof a multidisciplinary team. Work with experienced engineers to designand analyze aircraft, including integration of structure, landing gear,propulsion, subsystems, and crew/payload. Develop drawings, graphics, andtechnical reports to support the design, manufacture, and testing of newaerospace vehicles.</p>\n\n<p>Work and learnwith senior engineers to perform aerodynamic design and analysisand develop performance data for new vehicle designs. Thecandidate is expected to take into consideration the most efficient use ofthe natural laws affecting flight. Prior wind-tunnel test, CFDanalysis, propulsion integration, or aircraft performance and sizing experienceis a plus.</p>\n\n<p>BasicQualifications</p>\n\n<p>Candidates mustbe a new or recent graduate with a Master of Science degree in Aeronautical or MechanicalEngineering or related Science, Technology, Engineering, Mathematics (STEM)program. Must be eligible to obtain and retain a DoD secret clearance orSpecial Access Clearance.</p>\n\n<p>PreferredQualifications</p>\n\n<p>A current DoDsecret clearance and/or Special Access Clearance are preferred. Excellentverbal and written communication skills required. Preference given to candidates with somewind-tunnel test experience. A 3.7 GPA is preferred.</p>\n\n<p>Northrop Grumman Corporation is a leading global security company providinginnovative systems, products, and solutions in unmanned systems, cybersecurity,C4ISR, and logistics and modernization to government and commercial customersworldwide.</p>\n\n<p>Northrop Grumman is committed to hiring and retaining a diverseworkforce. We are proud to be an Equal Opportunity/Affirmative Action Employer,making decisions without regard to race, color, religion, creed, sex, sexualorientation, gender identity, marital status, national origin, age, veteranstatus, disability, or any other protected class. For our complete EEO/AA andPay Transparency statement, please visit www.northropgrumman.com/EEO.U.S. Citizenship is required for most positions.</p>",
      "name": "Vehicle Engineering - Eng. Aeronautical 1 - New Grad (East Coast)",
      "type": "external",
      "publication_date": "2017-01-31T19:26:55Z",
      "short_name": "vehicle-engineering-eng-aeronautical-1-new-grad-east-coast-920f99",
      "model_type": "jobs",
      "id": 213149,
      "locations": [],
      "categories": [
        {
          "name": "Aerospace, Aviation & Defense"
        }
      ],
      "levels": [
        {
          "name": "Entry Level",
          "short_name": "entry"
        }
      ],
      "tags": [
        {
          "name": "Fortune 1000",
          "short_name": "fortune-1000-companies"
        }
      ],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/northropgrumman/vehicle-engineering-eng-aeronautical-1-new-grad-east-coast-920f99"
      },
      "company": {
        "id": 792,
        "short_name": "northropgrumman",
        "name": "Northrop Grumman"
      }
    },
    {
      "contents": "<p>Are you looking for a career trajectory that few other organizations can offer in SAP? What about access to a high-quality portfolio of businesses and clients with opportunities to work across capabilities, industries, and geographies – in roles and on projects aligned with your SAP Finance skills? If this matches your interests and aspirations Deloitte may be right for you.</p>\n\n<p>Work you’ll do</p>\n\n<ul>\n    <li>Deliver Finance projects</li>\n    <li>Lead and support Finance pursuits and practice development initiatives</li>\n    <li>Develop external eminence across the sub-capabilities in Finance</li>\n    <li>Promote and participate in forums for sharing Finance expertise, strengthening Deloitte’s collective Finance knowledge and helping resolve our clients’ Finance challenges</li>\n    <li>Collaborate on innovative solutions to support the future of Finance</li>\n    <li>Develop your knowledge of and gain project experience in SAP’s new S/4 HANA Finance and future solutions</li>\n</ul>\n\n<p>Our Finance Capability aligns to various SAP products in the marketplace. These solutions address the following business process areas:</p>\n\n<ul>\n    <li>Core Finance – General Ledger, Accounts Payable, Accounts Receivable, Fixed Assets, Controlling, Costing, Treasury</li>\n    <li>Enterprise Performance Management Solutions – BPC, Cloud for Planning</li>\n    <li>Financial Reporting</li>\n</ul>\n\n<p>The team</p>\n\n<p>The full potential of SAP solutions isn’t just about technology, it’s also about driving sustainable business value. At Deloitte Consulting LLP, our SAP specialists deliver the technology and services to help our clients meet business performance goals and improve processes. As an SAP Global Partner we provide a broad range of consulting services, from HR, CRM and supply chain to finance transformation. Learn more about our SAP practice.</p>\n\n<p>Required qualifications</p>\n\n<ul>\n    <li>Functional/technical proficiency with at least 2+ full lifecycle SAP implementations and 4+ years of industry and/or consulting experience</li>\n    <li>At least 4 years of SAP experience implementing SAP BPC</li>\n    <li>Experience defining systems strategy, developing systems requirements, designing and prototyping, testing, training, defining support procedures and implementing practical business solutions under multiple deadlines</li>\n    <li>Adept at implementing technology-enabled business solutions for clients as part of a high-talent team and as a team lead or Project Manager on at least 1+ full cycle implementation</li>\n    <li>Able to collaborate with clients and have a strong desire to excel and be committed to gaining exposure to multiple industries while further developing your career</li>\n    <li>Strong configuration and design skills</li>\n    <li>Ability to travel 80-100% is REQUIRED</li>\n    <li>Bachelor’s degree or equivalent required</li>\n    <li>Master’s degree preferred</li>\n</ul>\n\n<p>How you’ll grow</p>\n\n<p>At Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Center.</p>\n\n<p>Benefits</p>\n\n<p>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.</p>\n\n<p>Deloitte’s culture</p>\n\n<p>Our positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives. Learn more about Life at Deloitte.</p>\n\n<p>Corporate citizenship</p>\n\n<p>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</p>\n\n<p>Recruiter tips</p>\n\n<p>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.</p>\n\n<p>Requisition code: E17LOSCSRCPL147-T</p>",
      "name": "SAP BPC - Senior Consultant (Finance Capability)",
      "type": "external",
      "publication_date": "2017-01-17T17:35:43Z",
      "short_name": "sap-bpc-senior-consultant-finance-capability-924efb",
      "model_type": "jobs",
      "id": 199837,
      "locations": [
        {
          "name": "Sacramento Metro Area"
        }
      ],
      "categories": [
        {
          "name": "Accounting & Finance"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/sap-bpc-senior-consultant-finance-capability-924efb"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    },
    {
      "contents": "<h3>Company Description</h3>\n\n<p>Illumio delivers adaptive security for every computing environment, protecting the 80 percent of data center and cloud traffic missed by the perimeter. The company’s Adaptive Security Platform™ visualizes application traffic and delivers continuous, scalable, and dynamic policy and enforcement to every bare-metal server, VM, container, and VDI within data centers and public clouds. Using Illumio, enterprises such as Morgan Stanley, Salesforce, NetSuite, Plantronics, NTT, King Entertainment, and Creative Artists Agency have achieved secure application and cloud migration, environmental segmentation, compliance, and high-value application protection from breaches and threats with no changes to applications or infrastructure. </p>\n\n<h3>Job Description</h3>\n\n<p><span></span></p>\n\n<p><span>The back-end QA group is looking for motivated, self-starting engineers to join our team. You need to enjoy learning new technologies, and solving/debugging complex problems. This will include research, and prototyping of methodologies and tools needed to address our verification needs.<span>  </span>You will contribute to expanding the existing back-end automation framework infrastructure/libraries, as well as writing automated test-cases as part of your day to day activities. <span> </span>We strive for 100% automation. You are expected to own features from inception to delivery, and work closely with development engineers, product-management, and program-management. The engineering teams (both QA and Development) are very collaborative and friendly. <span> </span>Thus, being a good team player is essential to the role.<span>  </span>The environment focuses on cutting-edge security in the virtualized computing and networking ecosystems.<span>  </span>The work is both challenging, and very satisfying.</span></p>\n\n<p><span></span></p>\n\n<p><span></span></p>\n\n<h3>Qualifications</h3>\n\n<p><b><span>Required Skills</span></b></p>\n\n<p><b><span></span></b></p>\n\n<ul><li><span>Proficient programming skills in one object-oriented higher-level language (e.g. Python, Ruby, Java), on a Linux operating system.</span></li><li><span>Experience in developing/automating test-suites, and test-cases in a fast paced start-up work environment.</span></li><li><span>Experience in testing virtualized computing and/or networking solutions in various private/public cloud environments (e.g. VMware EXSI private clouds, AWS public clouds).</span></li><li><span>5-7 years of experience</span></li></ul>\n\n<p><b><span></span></b></p>\n\n<p><b><span>Required Experience in at least one of these areas:</span></b></p>\n\n<p><span></span></p>\n\n<ul><li><span>Experience in testing, and automation of Cisco and/or Arista “top of rack” L2/L3 switches through standard APIs.</span></li><li><span>Experience in testing, and automation of “security groups” in AWS and/or Azure public clouds through standard APIs</span></li><li>Experience in testing, and automation of F5 server load-balancers</li></ul>\n\n<h3>Additional Information</h3>\n\n<p>All your information will be kept confidential according to EEO guidelines.</p>",
      "name": "Senior Backend QA Software Engineer",
      "type": "external",
      "publication_date": "2017-02-11T14:09:33.832251Z",
      "short_name": "senior-backend-qa-software-engineer-a2d93a",
      "model_type": "jobs",
      "id": 187540,
      "locations": [
        {
          "name": "Sunnyvale, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/illumio/senior-backend-qa-software-engineer-a2d93a"
      },
      "company": {
        "id": 1046,
        "short_name": "illumio",
        "name": "Illumio"
      }
    },
    {
      "contents": "<h3>Job Description</h3>\n\n<p></p>\n\n<p></p>\n\n<p>If you are passionate about working with smart teams across multiple departments that produce higher quality software products, AND with customers to provide the best product experience, then this role could be perfect for you.</p>\n\n<p>This is an exciting opportunity to lead a team of highly technical support engineers and collaborate with global teams. In this role:</p>\n\n<ul><li>You will drive a cross-product team to deliver resolutions for customer issues that other support teams could not resolve.  </li><li>You will be critical in guaranteeing customer satisfaction, product quality, and ongoing customer success with Atlassian products, working with your team to ensure service levels, support quality, and customer satisfaction targets, while being a key driver for product<span> </span><span><span><span><span><span><span><span><span>improvement,</span></span></span></span></span></span></span></span><span><span> </span>application performance, and corporate change.</span></li><li><span>You will coordinate root-cause analysis and fixes for complex issues and customers, while being key to providing a consistent quality experience, bringing new and improved support methodologies to Atlassian, and creating a wide and loyal customer base to the Atlassian products and brand.</span></li><li>You will also participate in customer facing calls helping to communicate progress updates, action plans, and resolution details. </li><li>You will participate in the broader ecosystem of Team Leads and Managers to<span> </span><span><span><span><span><span><span><span><span>improve</span></span></span></span></span></span></span></span><span><span> </span>the overall department and corporate operational efficiencies.  </span></li></ul>\n\n<p><strong><strong>More about you</strong></strong></p>\n\n<p>On your first day, we'd <span><span><span><span><span><span><span>love</span></span></span></span></span></span></span><span> </span>for you to have:</p>\n\n<ul><li>A passion for servicing customers and love people that have a strong sense of accountability and quality; you will be a person that is not comfortable with mediocre</li><li>Strong leadership and coaching skills within a production support, development, or service operations team; your soft skills should be exceptional for coaching and skill uplifting, as well as for both internal and external communications via phone, video conferences, presentations, and published blogs</li><li>That perfectly blended technical knowledge from an education in computer engineering, computer science, engineering or equivalent, along with a solid background in production support, development, or services roles.</li><li><span><span>Demonstrate strong judgment, decision-making, drive and insightful analytic skills; being process oriented but with flexibility to know when the process needs to change or evolve</span></span></li><li><span><span><span><span>Ability to prioritize</span></span></span></span> work and assess risk, while delivering a high-quality customer experience with an appropriate level of urgency.</li></ul>\n\n<p>It's great, but not required if :</p>\n\n<ul><li><span>You have experience with enterprise-level software solutions or with Atlassian specific products like JIRA, Confluence, or Stash.</span></li></ul>\n\n<p><strong><strong>More about<span> </span><span><span><span><span><span><span><span><span><span><span><span><span>our team</span></span></span></span></span></span></span></span></span></span></span></span></strong></strong></p>\n\n<p>The team is filled with top-notch technical individuals that are excited to be<span> </span><span><span><span><span><span><span><span><span>building</span></span></span></span></span></span></span></span><span> </span>a new service offering and experience for our customers. We challenge one another every day and hold ourselves accountable for our work product as well as our customer's overall success. We all enjoy the interactions with the customers,<span> </span><span><span><span><span><span><span><span><span>problem-solving,</span></span></span></span></span></span></span></span><span> </span>digging into complex issues, and actively championing for customers within Atlassian. We wake up every morning asking ourselves how we can<span> </span><span><span><span><span><span><span><span><span>improve</span></span></span></span></span></span></span></span><span> </span><span><span>the customer's experience,</span></span><span> </span><span><span><span><span><span><span><span><span>the quality of</span></span></span></span></span></span></span></span><span> </span>our product,<span> </span><span><span><span><span><span><span><span><span>the quality of</span></span></span></span></span></span></span></span><span> </span>our support system, or our individual weaknesses. We are not scared of challenges, nor do we back down or get deterred by<span> </span><span><span><span><span><span><span><span><span>tough problems.</span></span></span></span></span></span></span></span><span> </span>When problems seem the hardest we are at our best, working harder for the root cause and a solution. We are a combination of passion and persistence. We feel that through our roles we can<span> </span><span><span><span><span><span><span><span><span>positively</span></span></span></span></span></span></span></span><span> </span>impact millions of end-users and their experience with Atlassian products.<span> </span><span><span><span><span><span><span><span><span><span><span><span><span><span><span><span><span>We believe</span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span><span> </span>we can add significant value to the business by listening to<span> </span><span><span>the customer,</span></span><span> </span>translating these into actions, and championing their short-term issues and long-term needs throughout the organization.<span> </span><span><span><span><span><span><span><span><span>Our team</span></span></span></span></span></span></span></span><span> </span>is open, filled with varied backgrounds and talents, respectful, focused, located around the globe, and is all about providing legendary service to our customers.</p>\n\n<p><strong>More about the perks</strong></p>\n\n<p>Our offices are open, highly <span>collaborative</span> and yes, <span>fun!</span> To support you at work (and play) we offer some great perks: ample time off to relax and recharge, five paid volunteer days a year for your favourite cause, breakfasts/lunches &amp; snacks provided, ergonomic workstations, 20% work time for your passion projects, unique ShipIt days, a company paid trip after five years and more.</p>\n\n<p></p>\n\n<p></p>\n\n<h3>Additional Information</h3>\n\n<p><span><span><span><span><span><span><span><span><span><span><span><span><span><span><span><span>We believe</span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span><span> </span><span>that the unique</span><span> </span><span><span><span><span><span><span><span><span>contributions</span></span></span></span></span></span></span></span><span> </span><span>of all</span><span> </span>Atlassians<span> </span>is<span><span> </span>the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status</span><br></p>",
      "name": "Support Team Manager",
      "type": "external",
      "publication_date": "2017-02-11T14:09:42.142305Z",
      "short_name": "support-team-manager-2eaebc",
      "model_type": "jobs",
      "id": 192683,
      "locations": [
        {
          "name": "Sydney, Australia"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/atlassian/support-team-manager-2eaebc"
      },
      "company": {
        "id": 741,
        "short_name": "atlassian",
        "name": "Atlassian"
      }
    },
    {
      "contents": "<p>Deloitte Consulting in Hong Kong operates four core business lines: Strategy &amp; Operations, Human Capital, Actuarial &amp; Insurance Solutions and Technology Integration. Our practice is currently significantly expanding in both revenues as well as headcount due to our exciting and on-going Financial Services Industry Transformation Initiative.</p>\n\n<p>Deloitte’s Technology Integration team provides services to clients across commercial sectors in Hong Kong. The team brings together 100 experts with experience in specific industry domains and specialists in different technologies. Teams work on IT transformation, package implementation, advisory, architecture and strategy assignments. Engagements often see IT consultants working with business strategy and operations consultants to provide joint solutions to clients. The team is made up of professionals who enjoy the challenging assignments and the variety of working with different clients.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n    <li>Work in a fast growing and challenging environment with like-minded people who are eminent in their respective technical field;</li>\n    <li>Develop solutions through debate and discussion, in our teams and with clients;</li>\n    <li>Continue your professional development to reinforce and expand your chosen career path;</li>\n    <li>Work with high profile clients on a variety of local and international engagements.</li>\n</ul>\n\n<p>Requirements</p>\n\n<ul>\n    <li>3 to 7+ years of technology consulting experiences</li>\n    <li>Experience with in-house Financial services (investment banking, wealth management/private banking, insurance)</li>\n    <li>Experience with technology project delivery and project management</li>\n    <li>Experience in a consulting environment, conducting long-term digital/IT planning, customer journey modeling, innovation/ideation workshops, and/or agile project delivery is preferred;</li>\n    <li>Familiar with market trends and emerging technologies such as Big Data, Internet of Things, FinTech, etc.</li>\n    <li>Experience with eCommerce, Digital Transformation is a plus</li>\n    <li>The successful candidate should also demonstrate good communication skill</li>\n    <li>Ability to work independently and think creatively</li>\n    <li>Flexibility in learning new topics, handling change and deadlines</li>\n    <li>Skilled in all Microsoft tools such as PowerPoint, Excel, Word, Projects</li>\n    <li>Fluency in English and Cantonese/ Mandarin</li>\n</ul>\n\n<p>Deloitte Consulting China – Key highlights</p>\n\n<p>Deloitte Consulting has over 1,000 professional experts and consultants with bilingual service capabilities in China. Our talents from the Beijing, Shanghai, Shenzhen, Harbin and Hong Kong offices provide industry-oriented and high-quality strategy, human capital and IT consulting services covering the whole value chain of corporates to clients all over the Greater China region through Deloitte China’s extensive service network.</p>\n\n<p>About Deloitte</p>\n\n<p>Deloitte refers to one or more of Deloitte Touche Tohmatsu Limited, a UK private company limited by guarantee (“DTTL”), its network of member firms, and their related entities. DTTL and each of its member firms are legally separate and independent entities. DTTL (also referred to as “Deloitte Global”) does not provide services to clients.</p>\n\n<p>Deloitte provides audit, tax, consulting, and financial advisory services to public and private clients spanning multiple industries. With a globally connected network of member firms in more than 150 countries and territories, Deloitte brings world-class capabilities and high-quality service to clients, delivering the insights they need to address their most complex business challenges. Deloitte’s more than 200,000 professionals are committed to becoming the standard of excellence.</p>\n\n<p>Requisition code: CN122345</p>",
      "name": "Consultant / Senior Consultant – Digital (Financial Services) - Technology Integration - Consulting - Hong Kong",
      "type": "external",
      "publication_date": "2017-01-11T10:02:39Z",
      "short_name": "consultant-senior-consultant-digital-financial-services-technology-integration-consulting-hong-kong-bc98bb",
      "model_type": "jobs",
      "id": 195934,
      "locations": [],
      "categories": [
        {
          "name": "Consultants & Freelance Opportunities"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/consultant-senior-consultant-digital-financial-services-technology-integration-consulting-hong-kong-bc98bb"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    },
    {
      "contents": "<p>The tension between possibility and practicality is what we resolve. At Arrow, we’ve come full circle— from being a parts supplier at the physical heart of the radio business to being a global partner in the ongoing transformation of the most complex and exciting business on the planet. We are visionaries. Innovators. Mentors. In order to thrive and survive in today’s marketplace, we anticipate what will come tomorrow for our forward-thinking partners.</p>\n\n<p>Arrow serves as a supply channel partner for over 100,000 original equipment manufacturers, contract manufacturers and commercial customers through a global network of more than 460 locations in 56 countries.</p>\n\n<p>We are a Fortune 150 company with over 17,000 employees globally. Headquartered in beautiful Denver, Colorado, with offices worldwide.</p>\n\n<p>Five Years Out is a community of builders, designers, engineers and imaginers who navigate the path between possibility and practicality. Creating the future of everything from coffee makers to cars. Are you one of them? Then you’re working with us.</p>\n\n<p>Stay connected with us through social media</p>\n\n<p>https://www.twitter.com/ArrowJobs</p>\n\n<p>https://www.instagram.com/arrowelectronics/</p>\n\n<p>https://www.facebook.com/arrowfiveyearsout</p>\n\n<p>https://www.glassdoor.com/Overview/Working-at-Arrow-Electronics-EI_IE56.11,28.htm</p>\n\n<p>Quality Assurance Analyst</p>\n\n<p>A Quality Assurance Analyst (QA Analyst) in Arrow’s eCommerce division has the opportunity to do a lot more than validate requirements against software. An Arrow eCommerce QA Analyst works in any way necessary and with anyone necessary to protect the integrity and functionality of Arrow’s eCommerce platform. The QA Analyst is integral to the success of our eCommerce presence and is regarded as such. Arrow’s eCommerce presence not only provides shopping access to over 300 million searchable products, highly interactive design tools, and live access to specialists, but also keeps pace with the demand for the Internet of Things. By 2020, there will be an estimated 50 billion devices connected to the internet.</p>\n\n<p>Your work to assure a rock solid customer experience at Arrow will contribute directly to the future of the internet, five years out.</p>\n\n<p>You will apply your knowledge and expertise to define comprehensive tests, set test expectations and criteria, create and utilize processes for transferring manual tests to automated frameworks, and help provide actionable quality reports. Acquiring the data for millions of electronic parts and making them available to the Makers of the world is not an easy task. Working on a cross-functional Agile team, you will actively drive the quality assurance each sprint in tandem with your teammates. You will have every opportunity to help us reach for our goal of zero escaped defects.</p>\n\n<p>Our team is highly energetic, collaborative, and passionate about our work. We pride ourselves on incorporating the latest test methods, processes, and automation tools into our continuous integration development environment. This allows us to continually improve not only the experience for our customers, but the expediency with which we can deliver new functionality. We’re looking for a team member who wants to work hard to continuously improve their skills with us as we improve the quality, effectiveness, and value of our product.</p>\n\n<p>ESSENTIAL DUTIES AND RESPONSIBILITIES</p>\n\n<ul>\n    <li>Develop a reproducible system for automatically detecting and reporting defects</li>\n    <li>Learning the purpose and value behind each unit of functionality</li>\n    <li>Establishing processes for meeting the automated test needs of multiple projects</li>\n    <li>Collaborating with Quality Assurance Engineers to ensure the validity of automated tests</li>\n    <li>Research new tools and techniques to constantly improve the delivery of a quality product</li>\n    <li>Build not only automated tests, but automated reporting mechanism aimed at get the right information into the right hands</li>\n    <li>Providing automated test management in a continuous integration environment</li>\n    <li>Creating tests that cover functionality, load, security, etc. at the API and GUI levels</li>\n    <li>Working with developers to understand and identify edge case scenarios and provide related risks assessments.</li>\n    <li>Coach and educate others to increase early defect detection rates and decrease defect escape rates.</li>\n    <li>Make a difference</li>\n</ul>\n\n<p>REQUIRED SKILLS</p>\n\n<ul>\n    <li>A passion for learning and applying new test tools and techniques</li>\n    <li>Understanding of REST APIs,</li>\n    <li>Familiarity with Microsoft and Open Source development environments</li>\n    <li>Experience working as a QA Analyst in an Agile environment</li>\n    <li>Ability to discover and document errors produced by Javascript</li>\n    <li>Creation of test cases aligned to stories</li>\n    <li>Working with test engineers to automate tests for future regression testing</li>\n    <li>Ability to maintain a high level of effective communication with onsite and virtual teams.</li>\n    <li>Demonstrated communication and presentation skills, both written and verbal</li>\n    <li>Conflict resolution skills</li>\n    <li>Demonstrated self-management and personal accountability</li>\n</ul>\n\n<p>WORK HISTORY/QUALIFICATIONS</p>\n\n<ul>\n    <li>3+ years’ relevant experience working in a comparable software development environment</li>\n    <li>1+ years’ experience performing quality assurance analysis in an Agile development environment</li>\n</ul>\n\n<p>PREFERRED SKILLS</p>\n\n<ul>\n    <li>Microsoft .NET web application configuration and deployment</li>\n    <li>Previous experience as a Software Developer, Business Analyst, Product Owner</li>\n    <li>Recent technical knowledge of eCommerce implementation and security challenges</li>\n    <li>Atlassian software development tools</li>\n</ul>\n\n<p>EDUCATION</p>\n\n<ul>\n    <li>Bachelor’s degree or equivalent experience required</li>\n</ul>\n\n<p>WHAT’S IN IT FOR YOU?</p>\n\n<ul>\n    <li>Healthcare insurance</li>\n    <li>Vacation/Paid time off</li>\n    <li>401(k) plan, retirement plan and/or pension</li>\n    <li>Flexible schedule (e.g., work from home)</li>\n    <li>Community involvement opportunities</li>\n</ul>\n\n<p>MORE ABOUT ARROW</p>\n\n<p>Arrow helps the world’s best technology companies think “Five Years Out,” working together to innovate the next big thing, after the next big thing. We are a global provider of technology products, services and solutions, with 2014 sales of $22.8 billion. Our team includes 17,000 employees worldwide across more than 460 locations in 56 countries.</p>\n\n<p>“Five Years Out” is the tangible future and the people who live and work there know that new technologies, new materials, new ideas and new electronics will make life not only different, but better. Not just cheaper, but smarter. Not just easier, but more inspired.</p>\n\n<p>Are you “Five Years Out”? Then you’ll want to be working with us.</p>\n\n<p>FUNCTION:IT</p>\n\n<p>At Arrow, we are driving innovation and choice by offering employees a variety of benefits designed to keep you and your family physically and financially healthy.</p>\n\n<p>Our comprehensive, competitive benefits program is an important part of your total compensation package. We offer a variety of plans and coverage including health and welfare, retirement, paid time off, and voluntary benefits as well as resources to help you make cost-effective decisions for you and your family. Everyone counts at Arrow, and our benefits enable you to achieve and maintain better health and plan for your future as we work together toward smarter solutions in tomorrow’s technology.</p>\n\n<p>Arrow offers competitive time off for you, which includes accrued vacation time, personal and floating holidays, in addition to other observed holidays. These are granted based on the date you join the company in any given year.</p>\n\n<p>http://benefits.arrow.com</p>\n\n<p>EOE Minorities/Females/Protected Veterans/Disabled</p>\n\n<p>Arrow Electronics, Inc. is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please refer to our Hiring Process &amp; Accommodations Request Instructions on our Career Site to let us know the nature of your request and your contact information.</p>",
      "name": "IT Software Quality Assurance Analyst II 1971",
      "type": "external",
      "publication_date": "2017-02-09T12:31:46.17751Z",
      "short_name": "it-software-quality-assurance-analyst-ii-1971-f34518",
      "model_type": "jobs",
      "id": 77215,
      "locations": [
        {
          "name": "Englewood, CO"
        }
      ],
      "categories": [
        {
          "name": "Computer Systems Support"
        }
      ],
      "levels": [],
      "tags": [
        {
          "name": "Fortune 1000",
          "short_name": "fortune-1000-companies"
        }
      ],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/arrowelectronics/it-software-quality-assurance-analyst-ii-1971-f34518"
      },
      "company": {
        "id": 785,
        "short_name": "arrowelectronics",
        "name": "Arrow Electronics"
      }
    },
    {
      "contents": "<p>.Net. SQL. Agile. SCRUM. You’re a .Net front-end and SQL back-end programmer who enjoys hands-on development. You want to learn new technologies and new skills! You want to lead teams in an onshore/offshore model, be challenged, and realize growth opportunities! You want this role!</p>\n\n<p>Work you’ll do</p>\n\n<p>As a Senior Consultant on our NFTS, PSG, TARDI team, you will assist with the design, analysis, development, implementation, and deployment of new data-driven, web-based applications. Additionally, and you will:</p>\n\n<ul>\n    <li>Provide support for existing systems.</li>\n    <li>Work independently and within a team of developers to deliver end-to-end web solutions for moderate to complex projects.</li>\n    <li>Work with peers to carry out code reviews and unit testing of new development, and create unit test plans and scenarios for development unit testing.</li>\n    <li>Review project requirements and assess and estimate the necessary time-to-completion.</li>\n    <li>Document new developments, procedures, or test plans as needed.</li>\n    <li>Interact with other development teams to ensure a consistent, uniform approach to software development.</li>\n    <li>Prepare technical design documents using enterprise standard documentation tools.</li>\n    <li>Support system testing by following up on and closing defect tickets in a timely manner.</li>\n    <li>Deploy all integration artifacts to testing and production environments.</li>\n    <li>Supervise and mentor junior team members in U.S. and U.S.-India.</li>\n</ul>\n\n<p>The Team</p>\n\n<p>National Federal Tax Services (NFTS) is a national practice within Deloitte Tax LLP made up of a number of tax service offerings. Each NFTS service offering was developed and built as a result of a tax planning idea, a marketplace need, or a technological innovation—all with the purpose of delivering results for our clients.</p>\n\n<p>The Partnership Solutions Group (PSG) is a service line of NFTS and one of the fastest-growing practice groups in all of Deloitte Tax. PSG professionals counsel privately-held and publicly-traded partnerships across the United States on a wide-range of federal tax issues involving mergers, acquisitions, divestitures, initial public offerings, post-offering compliance, and process design and improvement.</p>\n\n<p>One of our fast-growing, unique service offerings is our Partnership Solutions Group, Tax Accounting &amp; Reporting for Debt Investments (TARDI) practice. Those pursuing investment opportunities in the distressed loan, MBS, and ABS markets are consistently challenged to properly address the complex tax accounting that can apply. This quickly becomes a task that is often heavily dependent upon effective data management. Through a combination of tools developed by Deloitte’s Securitization and Partnerships Solutions practices, we can assist with the complex tax and reporting needs of large pools of debt and debt securities.</p>\n\n<p>Qualifications</p>\n\n<ul>\n    <li>Required:</li>\n    <li>5+ years’ experience in .Net programming</li>\n    <li>Experience in web design and development in Microsoft technologies (.Net 3.5 or higher)</li>\n    <li>Experience with VP.Net, C#, Ajax, XML/XSLT/XPATH, ADO.NET, VB.NET, MVC, Angular.js, and Object-oriented programming</li>\n    <li>Bachelor’s degree in business information systems, computer science, business/technology or similar degree</li>\n    <li>Experience with SDLC methodologies</li>\n    <li>Experience developing and maintaining software framework and services using the .Net framework and Microsoft technologies</li>\n    <li>Good understanding of .Net Fundamentals (i.e., interfaces, inheritance)</li>\n    <li>Experience developing ASP.Net web services, windows services, and WCF</li>\n    <li>Knowledge of design patterns and architectural patterns</li>\n    <li>Experience with Visual Studio 2010 or higher</li>\n    <li>Experience with Source Control – TFS 2010</li>\n    <li>Experience with SQL Server 2012 or higher</li>\n    <li>Experience with database design, querying, stored procedures, views, joins, performance, etc.</li>\n    <li>Experience with computationally demandingsolutions</li>\n    <li>Experience working on Agile development methodology and SCRUM processes</li>\n    <li>Demonstrated effective verbal and written communication skills</li>\n    <li>Ability to work independently and virtually</li>\n    <li>Ability to understand business problem(s) being addressed by the project</li>\n    <li>Ability to work 50-60 hour work weeks and some weekends as needed</li>\n    <li>Able to travel up to 30%</li>\n    <li>Preferred:</li>\n    <li>Working knowledge on QlikView, HTML5, jQuery, and Kendo</li>\n    <li>Experience working in Financial Services environment</li>\n    <li>Experience working in consulting environment</li>\n</ul>\n\n<p>How you’ll grow</p>\n\n<p>At Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Center.</p>\n\n<p>Benefits</p>\n\n<p>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.</p>\n\n<p>Deloitte’s culture</p>\n\n<p>We take pride in our culture and celebrate individuals by recognizing their uniqueness. As a commitment to our people, we offer well-being programs and provide our professional’s opportunities for support and flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. This supportive culture helps enable our people to do their best work every day. Learn more about Life at Deloitte.</p>\n\n<p>Corporate citizenship</p>\n\n<p>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</p>\n\n<p>Recruiter tips</p>\n\n<p>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.</p>\n\n<p>#LI:TAX</p>\n\n<p>Requisition code: E17LOSTSRAFS021-NFT</p>",
      "name": "Senior Consultant TARDI, .Net, C#, SQL, developer with computation heavy applications, financial services",
      "type": "external",
      "publication_date": "2017-01-19T19:46:21Z",
      "short_name": "senior-consultant-tardi-net-c-sql-developer-with-computation-heavy-applications-financial-services-3f603a",
      "model_type": "jobs",
      "id": 200822,
      "locations": [
        {
          "name": "New York City Metro Area"
        }
      ],
      "categories": [
        {
          "name": "Accounting & Finance"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/senior-consultant-tardi-net-c-sql-developer-with-computation-heavy-applications-financial-services-3f603a"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    },
    {
      "contents": "<p>Based in San Francisco, CA, Weddington Way offers millennials a new way to shop for weddings, featuring an exclusive collection of fresh + modern bridesmaid dresses. Weddington Way designs and manufactures their own dresses - meaning no middle-men, no markups, and styles crafted with detail and intention that you can’t find anywhere else.  Weddington Way pioneered a community-centric shopping experience that lets friends shop together online in a virtual showroom.  With its technology-first approach, Weddington Way is a breath of fresh air in the wedding planning process.  </p>\n<p>In 2016, Weddington Way was acquired by Gap Inc. and continues to run as an autonomous brand under the leadership of founder Ilana Stern.  Ilana, now General Manager, reports to Sebastian DiGrande, Executive Vice President, Strategy and Chief Customer Officer for Gap Inc.</p>\n<p>For more information, please visit<a href=\"https://na01.safelinks.protection.outlook.com/?url=http://www.weddingtonway.com&amp;data=01|01|Ka345n9@mgd.gap.com|371790293d384eda675608d41af02944|348a129655b6466ea7af4ad1a1b79713|1&amp;sdata=roVfGVuaJOjquIC8kDuO/jMEGoY4Mv2snNkxEul0+2U=&amp;reserved=0\" target=\"_blank\"> http://www.weddingtonway.com</a>.</p>\n<p>Weddington Way’s team + culture:</p>\n<p>Our employees are our most valuable asset. We respect and listen to each other. We prioritize celebration and community. We believe in work/life balance, but we like when you bring your life to work. Seriously, we love meeting your dogs, cats, babies, husbands, girlfriends, moms, etc.</p>\n<p>Our team is made up of dynamic, intelligent, best in class individuals. Our employees come from a variety of backgrounds and industries, and bring with them a unique perspective, which we are excited to listen to. We believe that our brand is the only as good as the people behind it, and that we are stronger as team than as individuals. We believe in collaboration. We are equal parts hard work and heart.</p>\n<p>What we are looking for in our Head of Merchandising:</p>\n<p>We are looking for a leader who is excited to define the future of Weddington Way, creating and driving the strategy, while getting their hands dirty in day-to-day execution as we build Weddington Way into a national consumer brand.  Leaders at Weddington Way are both strategists and tacticians – we conceive, define and then drive.  Every leader in the company operates with the customer in mind first – we start with the customer and work backwards in everything we do.  This role will report directly to the GM and will be the thought leader in the company on merchandise direction, assortment architecture, inventory planning and more as it relates to overall financial business goals and brand goals.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Work with leadership team to define growth goals and brand goals and then the merchandising strategy and budget required to drive those goals</li>\n<li>Create and drive the merchandise strategy, from growing our current business in bridesmaid dresses, to defining and leading the expansion into future categories (bridal, groomsmen, accessories and more)</li>\n<li>Define assortment architecture (styles/colors/sizes to add/drop, when, etc.) based on data (customer feedback, historical selling data, etc.) and influence brand direction through shaping product direction</li>\n<li>Inventory planning (including but not limited to)</li>\n<li>Create inventory plan and budget needs based on sales targets</li>\n<li>Define and oversee purchase order and product delivery calendar with design/production team to properly time inflow of inventory</li>\n<li>Dynamically manage inventory levels to ensure we’re always in stock and selling through at the right rate (and defining what sell through should be)</li>\n<li>Create and own performance analysis – define, measure and analyze key business metrics to manage assortment and inventory levels to achieve (and exceed) sales targets</li>\n<li>Dynamic business management - identify sales growth opportunities based on assortment holes as well as liabilities that need to be managed and regularly iterate on strategy/plan accordingly</li>\n<li>Heavy cross functional leadership (including but not limited to)</li>\n<li>Oversee head of design/production and fashion designer</li>\n<li>Work closely with marketing team on product timeline and associated marketing support, including photo shoots, campaigns, etc.</li>\n<li>Work closely with store team – define assortment for Weddington Way stores, product knowledge and training in stores, etc.</li>\n<li>Oversee dissemination of product information to stylist team (customer service) to ensure stylists are well versed in what makes our products special as well as product/delivery timelines, etc</li>\n<li>10+ years work experience, including ~5 years in merchandising (work experience in strategy preferred)</li>\n<li>MBA preferred but not required</li>\n</ul>\n<p><IMG SRC=\"https://ad.doubleclick.net/ddm/ad/N4789.1896639THEDAILYMUSE/B10911179.145795253;sz=1x1;ord=1234567890;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=?\" BORDER=0 WIDTH=1 HEIGHT=1 ALT=\"Advertisement\"></p>",
      "name": "Head Of Merchandising - Weddington Way",
      "type": "external",
      "publication_date": "2017-02-09T15:29:24.879411Z",
      "short_name": "head-of-merchandising-weddington-way-c38acf",
      "model_type": "jobs",
      "id": 213834,
      "locations": [
        {
          "name": "San Francisco Bay Area"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [
        {
          "name": "Fortune 1000",
          "short_name": "fortune-1000-companies"
        }
      ],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/gapinc/head-of-merchandising-weddington-way-c38acf"
      },
      "company": {
        "id": 909,
        "short_name": "gapinc",
        "name": "Gap Inc."
      }
    },
    {
      "contents": "<p><strong>Overview</strong><br/>\n<p><span><span>Love working with and having an impact on kids? Do you thrive in new environments and love supporting the needs of a team? Ready to take your group management skills to the next level in an amazingly fun summer camp counselor job?</span><span><br> <br> Substitutes fill in for absences lasting a day, a week, and sometimes longer, and are scheduled to work only when regular staff members are absent. The Substitute Team Leader role is the perfect opportunity for those inspired by the idea of a Galileo summer, and who are open to or require a shorter summer commitment. Learn more about this role and working at Galileo in our </span><a href=\"http://www.galileo-camps.com/jobs/video-gallery\"><span>jobs video gallery</span></a><span>.<br> <br> </span><span>We value having divergent thinkers who bring various experiences and viewpoints to the table at Galileo. We strongly encourage members of underrepresented groups to apply.</span><span><br> <br> </span></span></p><p><span><strong><em><span>ABOUT GALILEO</span></em></strong></span></p><p><span>Galileo’s mission is to develop innovators who envision and create a better world. We know it’s bold. We also know that we can’t achieve it without asking staff to be role models of an innovator’s mindset—visionary, courageous, collaborative, determined and reflective. It’s not always easy. Camp staffers work hard. Very hard. You can expect days in which there’s a ton to get done and not a ton of time to do it. But part of what makes our culture great is that no one is too proud to complete any task that needs doing. Our camp staffers bring camp magic to life—for campers, and for themselves. </span></p><p><span> </span></p><p><span>This isn’t your average summer recreation gig. Galileans are expected to take ownership of their own performance and make this place better every day. People with a can-do attitude thrive here and those with a victim mentality don't. We manage to keep this level of performance expectation high in a relaxed environment; we take our work, but not ourselves, seriously. </span></p><p><span> </span></p><p><span><span>Being a Galilean means jumping into action to bring camp magic to life. Depending on the day, that could mean donning a tutu for a skit, creating a gorgeous sign that highlights the Galileo Innovation Approach, or playing a board game with two campers to build connection. </span><span>You’ve got to know what it means to be a vital part of a team. You’ve got to want to grow. You’ve got to like to have fun at work. You have to smile—a lot—and you have to like to laugh. After all, we run summer camps. You get the point.</span></span></p><p><span><strong><em><span> </span></em></strong></span></p><p><span><strong><em><span>SHARED VALUES AND EXPECTATIONS</span></em></strong></span></p><ul><li><span>Serve as an ambassador of Galileo, demonstrating our mission and values in a positive and professional manner and acting as a role model of the Galileo Innovator’s mindset</span></li><li><span>Commit to building a safe, child-focused community</span></li><li><span>Demonstrate professionalism and accountability</span></li><li><span>Take initiative to analyze and solve problems</span></li><li><span>Treat others with courtesy and respect</span></li><li><span>Respond to camper, family member and colleague needs</span></li><li><span>Strengthen our relationship with host site by upholding facility policies and embracing host site employees as partners</span></li><li><span>Maintain a high standard of ethics, integrity and confidentiality</span></li></ul><p><span><strong><span> </span></strong></span></p><p><span><strong><em><span>REQUIREMENTS</span></em></strong></span></p><ul><li><span> Commitment to educational programming for children</span></li><li><span> Flexibility to meet changing work needs and demands </span></li><li><span> Ability to work collaboratively on a high-functioning team</span></li><li><span> Openness to feedback and desire to grow professionally</span></li><li><span> Ability to handle multiple tasks efficiently and accurately </span></li><li><span> Strong organization skills and attention to detail</span></li><li><span> Ability to communicate clearly, maturely and compassionately with families </span></li><li><span> Ability to maintain an excellent work ethic, a high level of energy and exceptional enthusiasm all day, every day, for the duration of the summer<br> <br> </span></li></ul><p><span><strong><em><span>EXPERIENCE &amp; EDUCATION </span></em></strong></span></p><ul><li><span> Upper-level high school student, college student or graduate</span></li><li><span> Demonstrated leadership experience</span></li><li><span> Experience working with kids or in a camp setting a plus</span></li><li><span> Eighteen years of age or high school graduate by first day of camp’s operation</span></li></ul><p><span><strong><em><span> </span></em></strong></span></p><p><span><strong><em><span>ESSENTIAL DUTIES &amp; RESPONSIBILITIES</span></em></strong></span></p><ul><li><span> Travel to multiple sites within a geographic region, providing support in whatever way most benefits the specific camp team with whom you work on any assigned day</span></li><li><span> Lead teams of up to 18 campers to art, science and outdoor rotations</span></li><li><span> Become familiar with curriculum for majors in which you will assist </span></li><li><span> Assist Lead Instructors in delivering curriculum, learning skills necessary to be an effective and successful educator</span></li><li><span> Fill in for Summer Interns, supporting smooth camp operation through a variety of tasks that vary from lesson material preparation and clean up to sign making and lunch organization</span></li><li><span> Provide general support at camps with additional needs and/or higher camper enrollment</span></li><li><span> Provide leadership, energy and camp spirit for campers, constantly assessing group dynamics and the needs of individual campers</span></li><li><span> Cover for Team Leaders &amp; Assistant Instructors in the classroom during daily ten-minute breaks, fulfilling their role while they are out </span></li><li><span> Assist Team Leaders &amp; Lead Instructors in the classroom, working with campers individually and in small groups </span></li><li><span> Set, work toward, and achieve measurable professional development goals</span></li><li><span> Support camper check-in and check-out processes</span></li><li><span> Provide excellent customer service to families by communicating with them on a daily basis about their camper’s experience</span></li><li><span> Write daily updates to parents and weekly camper certificates</span></li><li><span> Assist with daily set up and clean-up of camp and assist Instructors with lesson preparation</span></li><li><span> Support morning and afternoon extended care program including check in, check out, and leading camper activities</span></li><li><span><span> Contribute to and participate in daily opening and closing ceremonies, all-camp activities, and snack &amp; lunch supervision and programming</span><span><br> <br> </span></span></li></ul><p><span><strong><em><span>WORK HOURS AND DATES</span></em></strong></span></p><p><span>The camp environment is demanding, requiring intense dedication and work ethic from each staff member. Depending on the time of summer or the specific week or day, the needs of camp and resulting staff hours may vary. We seek and make offers to staff who we believe are capable of thriving in this environment and contributing to camp’s success.</span></p><p><span> </span></p><p><span><strong><span>General Camp Staff Hours Information:</span></strong></span></p><ul><li><span>Staff may work anytime between 7:30am and 6pm, Monday through Friday. Number of hours and start/finish time will vary by site, position and day</span></li><li><span>Staff meetings: During regular work hours before or after the start of programming</span></li><li><span>Before setup days begin, complete between 2-12 hours of online training</span></li><li><span>Training and setup days: Participate in two mandatory training and setup days in the days before camp starts</span></li><li><span>Camp cleanup: Participate in cleaning and packing up camp for an additional 5-10 hours, typically an extra 1-2 hours at the end of each day during the final week of camp. On the last day of camp all staff stay on site until cleanup is complete, which will be 6pm at the earliest</span></li></ul><p><span> </span></p><p><span><strong><span>Position-Specific Hours Information</span></strong><span>: </span></span></p><p><span>For Substitute staff, the work environment (including the physical location and the staff team) changes from day to day and week to week. Depending on the time of summer or the specific week or day, the needs of camp and resulting staff hours may vary. The camp day runs, on average, 8-9 hours for Substitute Team Leaders and Assistant Instructors. Substitute Team Leaders and Assistant Instructors typically work 7:45-4:15, with some also working Extended Care hours until as late as 6pm</span></p><p><span> </span></p><p><span><strong><em><span>COMPENSATION</span></em></strong></span></p><p><span>We are committed to competitively compensating staff. Regarding compensation: </span></p><ul><li><span>Substitute Team Leaders and Assistant Instructors are compensated at a regular hourly rate of $11.00 per hour</span></li><li><span>Staff will be compensated at a different hourly rate (training rate) for 2-10 hours of online training to be completed before camp, and for 2 days on-site setup/training. Training and setup day hours will be compensated at a regular hourly rate of $8.25-11.00 per hour</span></li><li><span><span>Summer staff positions are temporary, seasonal positions and do not include</span><span> health benefits or paid vacation time</span></span></li><li><span>Overtime will be paid at 1.5x the regular hourly rate in accordance with state and federal requirements</span></li><li><span>Payroll is processed weekly; payments will be issued and paystubs made available the Friday after each camp week</span></li></ul><p><span><strong><em><span> </span></em></strong></span></p><p><span><strong><em><span>SUPERVISION GIVEN/RECEIVED </span></em></strong></span></p><p><span>General supervision, ongoing observation and evaluation is provided by Camp Directors, Area Directors, and the People Operations Team.</span></p><p><span><strong><em><span><br> </span></em></strong></span></p><p><span><strong><em><span> </span></em></strong></span></p><p><span><strong><em><span>PHYSICAL DEMANDS </span></em></strong></span></p><p><span>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable people with disabilities to perform the essential functions. </span></p><ul><li><span>Some lifting and carrying up to 60 lbs. </span></li><li><span>Typing, writing, reading</span></li><li><span>Seeing, hearing and speaking, both nearby and at a distance</span></li><li><span>Use hands and fingers to help with classroom supplies and operate equipment</span></li><li><span>Frequent sitting </span></li><li><span>Standing, walking, kneeling<br></span></li></ul></p>",
      "name": "Substitute Summer Camp Counselor/Assistant Instructor",
      "type": "external",
      "publication_date": "2017-02-11T14:04:23.558898Z",
      "short_name": "substitute-summer-camp-counselorassistant-instructor-743d22",
      "model_type": "jobs",
      "id": 121463,
      "locations": [
        {
          "name": "Chicago, IL"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/galileo/substitute-summer-camp-counselorassistant-instructor-743d22"
      },
      "company": {
        "id": 386,
        "short_name": "galileo",
        "name": "Galileo"
      }
    },
    {
      "contents": "<p><span>WeWork provides entrepreneurs and small businesses with beautiful workspace, personalized support, business services, digital tools, benefits, infrastructure, and the flexibility they need to succeed.</span></p>\n\n<p><span>Our team is a group of risk-taking, entrepreneurial spirits who instill the idea of working better together in everything that we do. WeWork’s success is the result of a collaborative effort by a group of talented and outstanding team members who challenge convention at every opportunity and take pride in building for the future.</span></p>\n\n<p><span>We are looking for a passionate and talented Marketing Lead who is responsible for launching and supporting our operations in Brazil.</span></p>\n\n<p><strong>About the Role</strong></p>\n\n<p>Under the general guidance of the General Manager and the Director of Sales along with related programming &amp; partnerships. Responsible for creating and executing marketing plans with regional &amp; HQ stakeholders with the goal of generating brand awareness, enhancing the member experience, and acquiring leads for new memberships.</p>\n\n<p><span>He/she is also responsible for managing third party agencies locally such as public relations, event production, entertainment, vendors, as well as liaising with stakeholders from HQ and the local region to protect the brand and connect to the local community needs. This role is not intended to be ‘9-6’ but a managerial and social role to act as a key connection with the local creative community.</span></p>\n\n<p><strong>General Duties</strong></p>\n\n<ul>\n<li><span>Create and implement a Marketing Strategy at all regional properties.</span></li>\n<li><span>Manage all marketing, public relations and promotional activities for buildings, common spaces, and related events.</span></li>\n<li><span>Update all relevant programming calendars and disseminate information to Operations and Community team.</span></li>\n<li><span>Manage weekly update to corporate team on your properties marketing efforts and results.</span></li>\n<li><span>Coordinate with HQ teams to manage, execute, and report on all global and local programming initiatives.</span></li>\n<li><span>Connecting with local influencers, potential partners, and potential members to establish WeWork as a vital part of the entrepreneurial and business communities in local markets</span></li>\n<li><span>Create meaningful local strategic partnerships with organizations &amp; individuals that will drive revenue and brand relevance to our buildings</span></li>\n<li><span>Conceptualizing and executing events to raise brand awareness</span></li>\n<li><span>Create, manage, and grow a database of local influencers who will become the base community members</span></li>\n<li><span>Giving tours and closing sales on a regular basis. Cold calling when necessary</span></li>\n<li><span>Manage and create content for our channels or partner channels, i.e. media outlets &amp; social</span></li>\n<li><span>Manage music &amp; entertainment program in your venues and ensure that they are compliant. Coordinate with corporate.</span></li>\n<li><span>Be on property as needed, minimum of 4 days and 3 nights weekly</span></li>\n<li><span>Manage local PR initiatives for all regional buildings. Maintain relationship with PR agency.</span></li>\n</ul>\n\n<p><strong>Administration</strong></p>\n\n<ul>\n<li><span>Prepare, implement, manage and compile data for the strategic marketing budget, forecasts and other reports as directed/required.</span></li>\n<li><span>Conduct weekly marketing meetings with community teams at all buildings to manage performance and adjust strategy to exceed goals.</span></li>\n<li><span>Oversee the monthly budgets/payouts and coordinate with stakeholders to submit invoices for promotions &amp; entertainment.</span></li>\n<li><span>Monthly KPI report on initiatives to regional and corporate team</span></li>\n</ul>\n\n<p><strong>Requirements</strong><span>:</span></p>\n\n<ul>\n<li><span>Required language skills: English and Portuguese</span></li>\n<li><span>Minimum 3 years of relevant experience</span></li>\n<li><span>Proficient in the use of Microsoft Office, Google Applications, and a good base of general computer knowledge</span></li>\n<li><span>Data -and results- driven</span></li>\n<li><span>Comfortable with cloud-based technology and Salesforce is a plus</span></li>\n<li><span>Ability to adapt quickly to change</span></li>\n<li><span>Highly creative, able to formulate a unique vision and flawlessly execute the vision</span></li>\n<li><span>Keen attention to detail</span></li>\n<li><span>Strong organizational and project management skills</span></li>\n<li><span>Excellent interpersonal skills; effectively communicates and collaborates with internal and external stakeholders at all levels of the organization      </span></li>\n<li><span>Ability to motivate team members and foster an environment of innovation   </span></li>\n<li><span>Strong work ethic and entrepreneurial spirit -- WeWork is growing incredibly quickly, meaning each employee will be given significant responsibility and autonomy.  This will mean hard work, but will also mean room for innovation in developing processes and/or programs that could benefit the company</span></li>\n</ul>\n\n<p><strong>About WeWork</strong></p>\n\n<p>WeWork is the platform for creators, providing more than tens of thousands of members around the world with space, community and services that enable them to do what they love and create their life's work. Our mission is to create a world where people work to make a life, not just a living, and our own team members are central to that goal.</p>\n\n<p>The WeWork team believes deeply in the power of “we” and in the movement we’re a part of. We challenge convention and achieve amazing things through dedication and collaboration. There is a contagious energy in our spaces as we work together toward accomplishing our goals.</p>\n\n<p>Our hunger for building great spaces; empowering startups, freelancers, and small businesses; and connecting interesting people is far from being satisfied. We’re just getting started, and our journey gets increasingly exciting as more team members join the movement!</p>\n\n<p>Below are the values that guide who we are and everything that we do. </p>\n\n<p><strong>Inspired</strong></p>\n\n<p>We do what we love and are connected to something greater than ourselves.<br> <strong><br> Entrepreneurial</strong></p>\n\n<p>We are creators, leaders and self-starters. We try new things, we challenge convention, and we’re not afraid to fail.<br> <strong><br> Authentic</strong></p>\n\n<p>We are genuine to our brand, mission and values. We’re not perfect and we don’t pretend to be. We are, though, always honest and as transparent as we can be. </p>\n\n<p><strong>Tenacious</strong></p>\n\n<p>We never settle. We get sh*t done and we get it done well. We’re persistent and knock down walls—literally if we have to.<br> <strong><br> Grateful</strong></p>\n\n<p>We are grateful for each other, our members, and to be part of this movement. We don’t take success for granted. We’re happy to be alive.</p>\n\n<p><strong>Together</strong></p>\n\n<p>We are in this together. This is a team effort. We always look out for one another. We value empathy; we know we’re all human, and know we can’t do any of this alone.</p>\n\n<p> </p>\n\n<p>#LI-AC1</p>",
      "name": "Marketing Lead, Sao Paulo",
      "type": "external",
      "publication_date": "2017-02-11T14:06:26.449982Z",
      "short_name": "marketing-lead-sao-paulo-af119d",
      "model_type": "jobs",
      "id": 218356,
      "locations": [
        {
          "name": "Sao Paolo, Brazil"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/wework/marketing-lead-sao-paulo-af119d"
      },
      "company": {
        "id": 106,
        "short_name": "wework",
        "name": "WeWork"
      }
    },
    {
      "contents": "<p>Deloitte Digital is creating a new model for a new age-we’re an agency and a consultancy.</p>\n\n<p>Understanding the digital space and preparing for what’s next is at our core. We help clients reimagine how profits are made, how relationships are created and managed; we reshape how work gets done, and rewire the competitive fabric of entire industries. That’s the power of driving disruption. That’s Deloitte Digital.</p>\n\n<p>Work you’ll do</p>\n\n<p>A Salesforce architect works within an engagement team and is responsible for identifying the organization’s needs, breaking down large scale projects to manageable tasks, working out which IT products to use based on cost benefit analysis and research, agreeing plans with the clients, explaining to designers and developers what’s required and overseeing the progress, producing documents that monitor progress and ensure the quality of the project and advising the client on managing future IT needs.</p>\n\n<p>The team</p>\n\n<p>Deloitte Digital’s vision is simple. We empower our clients to re-imagine how they connect and engage with their customers. Our goal is to be the best in world at driving digital transformation using the Salesforce platform. By redefining the customer’s digital journey, clients can look forward to stronger brand loyalty, a better a customer relationship, and a sales process so personal it feels effortless.</p>\n\n<p>Meet with our Salesforce team –</p>\n\n<p>https://vimeo.com/127116382</p>\n\n<p>Qualifications</p>\n\n<p>Required:</p>\n\n<ul>\n    <li>8+ years of consulting and / or CRM implementation experience.</li>\n    <li>4 full life-cycle Salesforce implementation with strong expertise in 2 of the following modules: Sales Cloud, Service Cloud, Marketing Cloud, Force.com, Apttus.</li>\n    <li>Experience managing at least two large-scale full-life cycle implementations of CRM solutions</li>\n    <li>Ability to travel to client sites 80-100% of the time.</li>\n    <li>Bachelor’s degree in computer science, information systems, or other technology-related field or equivalent number of years of experience.</li>\n</ul>\n\n<p>Preferred:</p>\n\n<ul>\n    <li>Previous “Big 4” experience.</li>\n    <li>Salesforce Certifications.</li>\n    <li>Experience with Wave Analytics, Lightening, Blue Kai, Eloqua, Exact Target or Marketo</li>\n    <li>Strong understanding of SDLC methodologies (Agile, SCRUM, RUP, other).</li>\n    <li>Experience presenting to clients or other decision makers to present and sell ideas to various audiences (technical and non-technical).</li>\n</ul>\n\n<p>Deloitte Digital Accolades</p>\n\n<p>Some of our major achievements are-</p>\n\n<ul>\n    <li>Deloitte has been named a Leader in CRM and Customer Experience Implementation Services by Gartner for the 4th consecutive year in their report entitled Magic Quadrant for CRM and Customer Experience Implementation Services, Worldwide 2015.</li>\n    <li>Deloitte Digital named a global leader in Digital Customer Strategy &amp; Experience Consulting by Kennedy in 2015.</li>\n    <li>Deloitte named a global leader in Internet of Things IT Consulting by Kennedy in 2015.</li>\n</ul>\n\n<p>How you’ll grow</p>\n\n<p>At Deloitte Digital, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help sharpen skills, work with industry-leading talent on a daily basis, in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career, while delivering products and services to Fortune 500 clients. Explore Deloitte University, The Leadership Center.</p>\n\n<p>Benefits</p>\n\n<p>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.</p>\n\n<p>Deloitte’s culture</p>\n\n<p>Who says work can’t be fun? At Deloitte Digital, the worlds of business, creative, and technology intersect to transform the way we work, play, and communicate. We can’t quite put our finger on it, but that combo creates something kind of magical. In studios or on the road, we believe in our people, and we understand that quality of life directly impacts quality of work. We pride ourselves on our flexible work environment and distinctive culture. Learn more about life at Deloitte Digital.</p>\n\n<p>Corporate citizenship</p>\n\n<p>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</p>\n\n<p>Recruiter tips</p>\n\n<p>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.</p>\n\n<p>kwdeldigsfdcusa</p>\n\n<p>kwdeldigallddusa</p>\n\n<p>Requisition code: E17WESCMGRCG002 – DD</p>",
      "name": "Salesforce Architect Manager",
      "type": "external",
      "publication_date": "2016-12-27T21:48:10Z",
      "short_name": "salesforce-architect-manager-3d6296",
      "model_type": "jobs",
      "id": 208136,
      "locations": [
        {
          "name": "Louisville, KY"
        }
      ],
      "categories": [
        {
          "name": "Sales & Business Development"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/salesforce-architect-manager-3d6296"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    },
    {
      "contents": "<p>Join our Strategy &amp; Operations (S&amp;O) team this summer to enhance your education and accelerate your career. As a Summer Associate, you’ll work side by side with innovative and strategic thought leaders and stay ahead of the rapidly evolving world of business. You’ll get the training to be confident and prepared to help tackle some of our clients’ most complex business issues. When you become a member of our team not only will you experience our supportive work culture, but you’ll also receive first-hand insights into the day-to-day challenges and opportunities faced by our consultants.</p>\n\n<p>Work you’ll do</p>\n\n<p>As a Summer Associate, you’ll work with diverse global clients across a wide range of industries. You will have a variety of client-facing responsibilities including interviewing staff, gathering data, analyzing issues, formulating and making recommendations, and helping clients implement proposed solutions. During your time with us, you’ll sharpen your consulting and networking skills by taking part in social outings, office-wide team meetings, and community service events.</p>\n\n<p>The team</p>\n\n<p>Our Strategy &amp; Operations consultants offer insightful recommendations and data-fueled strategies to help our clients address some of their most complex business issues. We are a diverse and talented team that supports a collaborative culture and delivers value through the application of strategy and process improvement. We tackle our clients’ organizational strategy, financial management, supply management, innovation, and growth issues and help to enhance their business performance, productivity, and long-term profitability. Join us, and play a key role in designing our clients’ roadmap to the future. Learn more about our Strategy &amp; Operations practice.</p>\n\n<p>Qualifications</p>\n\n<p>Required</p>\n\n<ul>\n    <li>Enrollment in an MBA program with 3+ years’ work experience, preferably in a large company setting</li>\n    <li>Strong academic track record</li>\n    <li>Exceptional communication and analytical skills with the ability to communicate findings to clients and team members</li>\n    <li>Ability to work independently and collaboratively with a team in a fast-paced environment</li>\n    <li>Willingness to travel</li>\n    <li>U.S. Citizenship and ability to obtain U.S. Security Clearance (Federal Practice candidates only)</li>\n</ul>\n\n<p>How you’ll grow</p>\n\n<p>During this exciting and challenging learning experience, you’ll gain first-hand insights into technical skills, critical professional behaviors, standards, and mindsets to help you expand on your previous experience, knowledge and skills. You’ll work with a wide variety of talented strategic leaders and learn how to develop, implement, and measure innovative strategies, tackle real-world business issues head-on, and experience what it’s like to be a part of our work culture.</p>\n\n<p>Deloitte’s culture</p>\n\n<p>Our positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives. Learn more about Life at Deloitte.</p>\n\n<p>Corporate citizenship</p>\n\n<p>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</p>\n\n<p>Recruiter tips</p>\n\n<p>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. We also suggest that you brush up on your behavioral and case interviewing skills and practice discussing your experience and job history with a family member, friend, or mentor. Check out recruiting tips from Deloitte professionals.</p>\n\n<p>Requisition code: S17CBSCI18MAYAM-SO</p>",
      "name": "Summer Associate - Strategy & Operations, MBA, Consulting- Columbia Business School",
      "type": "external",
      "publication_date": "2016-12-27T21:48:12Z",
      "short_name": "summer-associate-strategy-operations-mba-consulting-columbia-business-school-62e7d4",
      "model_type": "jobs",
      "id": 202771,
      "locations": [
        {
          "name": "San Francisco Bay Area"
        }
      ],
      "categories": [
        {
          "name": "Operations"
        }
      ],
      "levels": [
        {
          "name": "Entry Level",
          "short_name": "entry"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/deloitte/summer-associate-strategy-operations-mba-consulting-columbia-business-school-62e7d4"
      },
      "company": {
        "id": 230,
        "short_name": "deloitte",
        "name": "Deloitte"
      }
    }
  ]
