[{
      "contents": "<p>Due to the rapid growth of World First, the HR Department are looking for an experienced, enthusiastic and pro-active Learning &amp; Development Manager to join their team. Reporting into the Global Head of Learning &amp; Development, your key focus will be to support our London office.</p>\n\n<p><strong>Key responsibilities</strong></p>\n\n<ul><li>Build and maintain relationships with department heads, identifying development needs and trends. Work with the L&amp;D Advisor to identify and source development solutions, in line with global L&amp;D initiatives.</li><li>Partner with Gallus Consulting to deliver our management programme locally (Managing People First), including 360 debriefs, workshop and ALG facilitation and one-to-one coaching.</li><li>Develop and manage a core offering to continue the development of our Managing People First Alumni, in line with current and future business requirements</li><li>Work with the L&amp;D Advisor to design and deliver soft skills training, partnering with external providers when required. Support the L&amp;D Advisor in creating a core offering for continued development in line with business needs.</li><li>Support managers with performance reviews and personal development planning, providing ongoing training, guidance and one-to-one coaching</li><li>Embed our behavioural competency framework into core HR/L&amp;D processes</li><li>Oversee professional qualifications, working with Compliance and CF30 managers to ensure T&amp;C requirements are met</li><li>Work with the L&amp;D Advisor to evaluate all local L&amp;D programmes and interventions, demonstrating ROI and continual improvement</li><li>Work with the Global Head of L&amp;D to set the annual L&amp;D strategy and budget for EMEA, and manage this accordingly</li><li>Produce bi-annual L&amp;D reports demonstrating key activities and ROI</li><li>Line manage the L&amp;D Advisor and oversee our core programmes (ie induction, internal seminars, etc)</li><li>Provide L&amp;D support to our Netherlands office, as well as any future offices in the EMEA region as we continue to grow</li></ul>\n\n<p> <strong>You will</strong><strong>:</strong></p>\n\n<ul><li>Be educated to degree level and/or HR/L&amp;D professionally qualified, with a proven track record in a similar role</li><li>Have a track record of delivering forward thinking L&amp;D initiatives and be experienced in business partnering to a senior level</li><li>Have experience in designing and delivering high quality training, with strong presentation and facilitation skills</li><li>Have knowledge and experience in leadership/management development</li><li>Have prior experience in a financial services company (preferable but not essential)</li><li>Be a strong communicator with the ability to establish and manage relationships at all levels</li><li>Be solutions focused with strong analytical skills and a consultative approach</li><li>Be a strong team player but have the ability to work autonomously</li><li>Be a brilliant people person who thrives on the development of people and takes pride in delivery of L&amp;D solutions</li></ul>\n\n<p><strong>What you will get:</strong></p>\n\n<ul><li>Basic salary: Competitive</li><li>Excellent benefits package including annual discretionary bonus, season ticket loan, company pension scheme and health cover</li><li>A fun working environment based in central London</li><li>Free breakfast, Friday beer fridge, tri-annual company parties, bi-annual team nights out, annual charity day and more!</li></ul>\n\n<p><br>#LI-BR1</p>",
      "name": "Learning & Development Manager",
      "type": "external",
      "publication_date": "2017-02-11T14:09:25.163471Z",
      "short_name": "learning-development-manager-89fbae",
      "model_type": "jobs",
      "id": 126085,
      "locations": [
        {
          "name": "London, United Kingdom"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/worldfirst/learning-development-manager-89fbae"
      },
      "company": {
        "id": 1170,
        "short_name": "worldfirst",
        "name": "World First"
      }
},

{
      "contents": "<p>(New York, NY)</p>\n\n<p>Facebook’s mission is to give people the power to share, and make the world more open and connected. Through our growing family of apps and services, we’re building a different kind of company that helps billions of people around the world connect and share what matters most to them. Whether we’re creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to make the world more open and accessible. Connecting the world takes every one of us—and we’re just getting started.</p>\n\n<p>Analogous to an Account Director in an agency, the Head of Americas serves as the overall general manager for the Guild and supports the business and marketing needs of the region. He/she oversees all creative and digital projects and initiatives and ensures that they are insight-driven, on-brand, and on-strategy and that they are delivered in an efficient, cost-effective manner that drives scaled results for the business.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n    <li>Oversees all Guild projects and activities, spanning across creative and digital, serving as initial point of a contact for all creative and digital briefs across both North America and Latin America</li>\n    <li>Serves as connective tissue across digital and creative efforts</li>\n    <li>Partners closely with creative teams to ensure work is on brand and delivers on creative briefs and is activated across all appropriate channels</li>\n    <li>Partners closely with digital teams to ensure insights are leveraged for creative work and that results/learnings are shared/scaled across the region</li>\n    <li>Manages overall relationships and partnerships with vertical/audience/country managers</li>\n    <li>Partners closely with regional leadership and vertical/audience/country managers to understand needs and priorities and plan for work accordingly</li>\n    <li>Leads development, coordination, and activation of global campaigns in region</li>\n    <li>Oversees the activation of all global campaigns across countries/region, partnering closely with vertical managers/audience managers/country managers to ensure campaigns are localized properly and that they have the resources, assets, and tools they need to effectively scale global programs to their audiences</li>\n    <li>Leads development of pan-regional campaigns and oversees execution and activation with vertical/audience/country managers</li>\n    <li>Manages all cross-regional marketing vendors and relationships</li>\n    <li>Oversees roll-out and usage of marketing tools, such as Workfront, creative brief, etc.</li>\n    <li>Identifies programs and assets created in other regions than can be scaled within their region and communicate with vertical/audience/country managers to determine applicability</li>\n    <li>Oversees all regional Guild budgets and budgeting processes</li>\n    <li>Sits on global Guild leadership team and participates in the global management and evolution of the Guild (contribute needs and prospective solutions)</li>\n</ul>\n\n<p>Minimum Qualifications</p>\n\n<ul>\n    <li>15+ years of marketing experience</li>\n    <li>Ability to manage numerous projects and programs</li>\n    <li>Knowledge of digital marketing</li>\n    <li>Ability to work with creative teams</li>\n    <li>Ability to oversee operations</li>\n</ul>",
      "name": "Head of Americas, Guild",
      "type": "external",
      "publication_date": "2017-01-11T08:28:51Z",
      "short_name": "head-of-americas-guild-fea3b2",
      "model_type": "jobs",
      "id": 165178,
      "locations": [
        {
          "name": "New York City Metro Area"
        }
      ],
      "categories": [
        {
          "name": "Marketing"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [
        {
          "name": "Fortune 1000",
          "short_name": "fortune-1000-companies"
        }
      ],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/facebook/head-of-americas-guild-fea3b2"
      },
      "company": {
        "id": 659,
        "short_name": "facebook",
        "name": "Facebook"
      }
    }]